{"basics":{"name":"Zhiyu Xie","label":"","image":"","email":"zhiyuxie@stanford.edu","phone":"","url":"https://zhiyuxie.top/","location":{"address":"","postalCode":"10001","city":"New York","countryCode":"US","region":"New York"},"profiles":[{"network":"GitHub","username":"xiezhiyu01","url":"https://github.com/xiezhiyu01"}]},"work":[{"name":"Cubist Systematic Strategies","position":"Quantitative Software Developer","startDate":"2025-07-14"},{"name":"Two Sigma, Security Incident Response Team","position":"Intern","url":"https://www.twosigma.com","startDate":"2024-06-17","endDate":"2024-08-23","summary":"LLM Security Application Reviewer","highlights":["Developed the LLM Security Application Reviewer to streamline the security assessment process for Windows applications.","Implemented a Flask-based web service with a React frontend and a Postgres database.","Integrated security check APIs (e.g., VirusTotal, Signify) to analyze application executables.","Leveraged LLMs to extract security-related information from application manuals, enhancing performance with Retrieval-Augmented Generation (RAG), semantic chunking, and a second-pass LLM filter.","Deployed the service to production, reducing review time from days to 4 minutes, with an estimated annual savings of 1.25 FTE."]},{"name":"Google, TensorFlow Lite Team","position":"Intern","url":"https://www.tensorflow.org/lite","startDate":"2021-07-04","endDate":"2021-09-24","summary":"Model Distillation in TensorFlow Model Maker Library","highlights":["To further facilitate TensorFlow Lite on-device training, this work introduced model distillation method for model compression in TensorFlow Lite Model Maker library.","Followed Object-oriented programming principles to implement model distillation for image, audio and text classification tasks, enabling users to create a fine-tuned end-to-end model on a customized dataset in just 6 lines of code.","Carried out comprehensive experiments to show that the work can lead to a 90% reduction of parameters while maintaining a competitive and sometimes better accuracy performance compared to the teacher network."]},{"name":"UCLA PlusLab","position":"Research Assistant","url":"https://vnpeng.net/group/","startDate":"2022-06-01","endDate":"2023-05-01","summary":"AMR-Aware Prefix for Generation-Based Event Argument Extraction Model","highlights":["Incorporated useful external information, Abstract Meaning Representation (AMR) Graph, into generative models, which have been important for event argument extraction task because of their flexibility and efficiency.","Proposed AMPERE, which generates AMR-aware prefixes for every layer of the generation model.","Introduced an adjusted copy mechanism to AMPERE to help overcome potential noises.","Our method gains 4% − 10% absolute F1 score improvements and is especially effective in low-resource settings."]},{"name":"THUNLP","position":"Research Assistant","url":"https://nlp.csai.tsinghua.edu.cn/","startDate":"2020-09-01","endDate":"2021-02-01","summary":"Reviewing Test Protocols of Distantly Supervised Relation Extraction","highlights":["Examined two popular relation extraction datasets (NYT10 and Wiki20) for annotation errors due to distant supervision methods adopted.","Proposed an improved relation ontology and adopted data-cleaning, constructed manually-annotated test sets for NYT10 and Wiki20, correcting 53% wrong labels in NYT10.","Analyzed performance differences of competitive models on manually-annotated and distantly supervised datasets.","Our conclusion sheds light on the importance of a more accurate evaluation for relation extraction research."]}],"volunteer":[],"education":[{"institution":"Stanford University, CA, United States of America","url":"https://cs.stanford.edu/","area":"Computer Science","studyType":"Master of Science","startDate":"2023-09-01","endDate":"2025-06-01","score":"","courses":["GPA: 4.26/4.30","Randomized Algorithms (A+)","Deep Generative Models (A+)","Distributed System (A+)","Computer Vision (A+)","Introduction to Cryptography (A+)"]},{"institution":"Tsinghua University, Beijing, China","url":"https://www.cs.tsinghua.edu.cn/csen/","area":"Computer Science and Technology","studyType":"Bachelor of Engineering","startDate":"2019-08-14","endDate":"2023-06-30","score":"","courses":["GPA: 3.97/4.00 (Rank 3/202)","Data Structures (A)","Introduction of Theory of Computation (A)","Operating Systems (A)","Compiler Construction (A)","Theory of Computer Network (A)"]}],"awards":[],"certificates":[],"publications":[],"skills":[],"languages":[{"language":"Chinese (Mandarin)","fluency":"Native speaker"},{"language":"English","fluency":"Fluent"}],"interests":[],"references":[],"projects":[]}